import styles from "./AboutText.module.css";
import photo from "../../../assets/about/pexels-minhle17vn-977213.jpg";

const AboutText = () => {
  return (
    <div className={styles.aboutPageContainer}>
      <h1 className={styles.mainTitle}>Хто ми</h1>
      <section className={styles.contentSection}>
        <div className={styles.textBlock}>
          <h2 className={styles.sectionTitle}>
            Подорожуйте легко. Ваша поїздка починається тут.
          </h2>
          <p>
            Ми створили наш сервіс з однією простою метою: зробити купівлю
            автобусних квитків сучасною, зручною та надійною. Ми знаємо, що
            потреба у переміщенні існує завжди, і ми тут, щоб цей процес був для
            вас максимально простим, незалежно від того, пасажир ви чи
            перевізник.
          </p>
        </div>
        <div className={styles.textWithImageBlock}>
          <img src={photo} alt="Aвтобус" className={styles.sideImage} />
          <h2 className={styles.sectionTitle}>Наша історія</h2>
          <p>
            Все почалося з розуміння, що ринку потрібна гнучка та дружня до
            користувачів платформа. Ми побачили, що пасажири втомилися від
            застарілих сервісів, прив&#39;язаних до автостанцій, а приватні
            перевізники потребують простого інструменту для пошуку клієнтів без
            необхідності створювати власні сайти. Так народилася наша ідея —
            єдиний сервіс, орієнтований на максимальну простоту для всіх.
          </p>
        </div>
        <div className={styles.textBlock}>
          <h2 className={styles.sectionTitle}>
            Для пасажирів: Ваш спокій у дорозі
          </h2>
          <p>
            Ми дбаємо про те, щоб ваша поїздка була комфортною ще на етапі
            планування. Користуючись нашим сервісом, ви отримуєте:
          </p>
          <ul className={styles.featuresList}>
            <li>
              Економію часу завдяки простому та приємному інтерфейсу для
              онлайн-бронювання.
            </li>
            <li>
              Надійні гарантії: ми гарантуємо наявність місць, повернення коштів
              та страхування поїздки.
            </li>
            <li>
              Безпеку та прозорість: у нас діє система перевірки водіїв, відгуки
              та оцінки, а також GPS-трекінг автобуса в реальному часі.
            </li>
          </ul>
        </div>
        <div className={styles.textBlock}>
          <h2 className={styles.sectionTitle}>
            Для водіїв та перевізників: Ваш надійний партнер
          </h2>
          <p>
            Ми розглядаємо перевізників як повноцінних партнерів і пропонуємо їм
            вигідні та прозорі умови для розвитку бізнесу. З нами ви отримуєте:
          </p>
          <ul className={styles.featuresList}>
            <li>
              Нових клієнтів: наша платформа є простим посередником для пошуку
              пасажирів, що розширює вашу аудиторію.
            </li>
            <li>
              Вигідні умови: ми пропонуємо низькі комісії, а для перевірених
              водіїв — персональне партнерство зі знижками та додатковим
              просуванням.
            </li>
            <li>
              Автоматизацію роботи: сервіс надає зручну звітність, дозволяючи
              вам зосередитись на головному — перевезеннях.
            </li>
          </ul>
        </div>
        <div className={styles.textBlock}>
          <h2 className={styles.sectionTitle}>Наш шлях уперед</h2>
          <p>
            Ми починали з роботи на обласних та міжобласних маршрутах, щоб
            довести якість нашого сервісу. Наша мета — поступово масштабуватися
            до національного рівня, а згодом вийти на міжнародні ринки. Ми
            віримо у створення сильної спільноти лояльних користувачів та
            водіїв, і щодня працюємо над тим, щоб бути найкращими для вас.
          </p>
        </div>
      </section>
    </div>
  );
};

export default AboutText;
